In [1]:
import pandas as pd

# DataFrame
- 2 차원 배열  
- 행과 열로 구성  
- DataFrame 만들때에는 Dictionary가 편함!

In [2]:
# Dictionary를 이용한 DataFrame 생성

dict_data = {'c0':[1,2,3], 'c1':[4,5,6],'c2':[7,8,9], "c3":[10,11,12], 'c4':[13,14,15]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [3]:
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

list 는   
         -  
         -  
         -  
이렇게 쌓이고  
Dictionary 는 | | | 이렇게 쌓인다

In [4]:
# List를 이용한 DataFrame 생성
df = pd.DataFrame(
    [
        [15,'남','덕영중'],
        [17, '여', '수리중']
    ],index=['준서','예은'],
     columns=['나이','성별','학교']
)
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [5]:
# 행과 열 이름 변경하기
print(df.index)
print(df.columns)

Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [6]:
# 행 인덱스 , 열 이름 변경하기 - 1
df.index = ['학생1','학생2']
df.columns = ['연령','남녀','소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [7]:
# List를 이용한 DataFrame 생성
df = pd.DataFrame(
    [
        [15,'남','덕영중'],
        [17, '여', '수리중']
    ],index=['준서','예은'],
     columns=['나이','성별','학교']
)
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [8]:
# 행 인덱스 , 열 이름 변경하기 - 2
# inplace=True 모든함수에 적용가능한 명령어 = > 바로 적용하겠다 라는 명령어
df.rename(columns={'나이':'연령','성별':'남녀',"학교":'소속'}, inplace=True)
df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [9]:
# 행 이름 변경하기
# df의 행 인덱스 중에서, '준서'를 '학생1'로, '예은'을 '학생2'로 바꾸기
df.rename(index={'준서':'학생1', '예은':'학생2'}, inplace=True)
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

---
### 문제

In [10]:
score = {'서준':[90, 98, 85, 100],'우현':[80,89,95,90],'인아':[70,95,100,90]}
score

{'서준': [90, 98, 85, 100], '우현': [80, 89, 95, 90], '인아': [70, 95, 100, 90]}

In [11]:
score_df = pd.DataFrame(score).T
score_df

     0   1    2    3
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [12]:
score_df.rename(columns={0:'수학',1:'영어',2:'음악',3:'체육'}, inplace= True)
score_df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

### 행삭제

In [13]:
# 복사하기
df2 = score_df.copy()

In [14]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [15]:
# df2의 index가 우현인 1개 행을 삭제 => drop()
df2.drop('우현', axis=0, inplace= True) #axis=0  (== axis='rows')디폴트값 인데 적어주는게 좋음

In [16]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [17]:
# 복사하기
df3 = score_df.copy()

In [18]:
df3

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [19]:
#df3의 index가 우현과 인아인 2개 행을 삭제
df3.drop(['우현','인아'], axis=0, inplace=True)
df3

    수학  영어  음악   체육
서준  90  98  85  100

### 열삭제

In [20]:
# 복사하기
df4 = score_df.copy()
df4

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [21]:
# df4의 수학 1개 열을 삭제
df4.drop('수학', axis=1, inplace=True)

In [22]:
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [23]:
# 복사하기
df5 = score_df.copy()
df5

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [24]:
# dr5의 영어와 음악 2개 열을 삭제
df5.drop(["영어","음악"],axis='columns', inplace=True)
df5

    수학   체육
서준  90  100
우현  80   90
인아  70   90

---

## 행선택(열이 아님!)
- index 이름을 기준으로 선택할 경우에는 loc를 사용
- 정수형 위치 index를 사용할 경우에는 iloc를 사용

In [25]:
df = score_df.copy()

In [26]:
#index가 서준인 행을 선택
print(df.loc['서준'])
print(df.iloc[0])

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [27]:
# 행 인덱스를 사용하여 서준과 우현 2개 행을 선택
# loc사용
print(df.loc[['서준','우현']],"\n")

#iloc 사용
print(df.iloc[[0,1]],"\n") # OR
print(df.iloc[0:2])

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

- Python이 어려운 이유는 방법이 너무 많아서 다른사람 소스 참고하기가 너무 어려워

## 열선택 하는 방법

In [28]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [29]:
df['수학']

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [30]:
df.수학

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

### 범위 Slicing 활용
- [::-1]
- dataFrame.iloc[시작index:끝index:증가치]

In [31]:
# 처음부터 끝까지 index가 2씩 증가
df.iloc[::2]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [32]:
# 0번 인덱스부터 3번인덱스까지 인덱스 2씩 증가
df.iloc[0:3:2]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [33]:
# -1은 거꾸로 맨뒤부터 시작
df.iloc[::-1]

    수학  영어   음악   체육
인아  70  95  100   90
우현  80  89   95   90
서준  90  98   85  100

### 행과 열을 이용한 데이터 선택

In [34]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [35]:
print(df.loc['서준',['음악','체육']])
print(df.iloc[0,2:4])
print(df.loc['서준','음악':'체육'])

# 체육은 제일 끝까지 있으니끼 다 안적어도 되네?
print(df.loc['서준','음악':])
print(df.iloc[0,2:])

음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64

### 행열 추가하기

In [36]:
# 열추가
df['국어'] = [10,20,30]
df

    수학  영어   음악   체육  국어
서준  90  98   85  100  10
우현  80  89   95   90  20
인아  70  95  100   90  30

In [37]:
df['일본어'] = 50
df

    수학  영어   음악   체육  국어  일본어
서준  90  98   85  100  10   50
우현  80  89   95   90  20   50
인아  70  95  100   90  30   50

In [38]:
# 행추가 할때는 loc
df.loc['철수'] = [10,20,30,40,50,60]
df

    수학  영어   음악   체육  국어  일본어
서준  90  98   85  100  10   50
우현  80  89   95   90  20   50
인아  70  95  100   90  30   50
철수  10  20   30   40  50   60

In [39]:
df.loc['영희'] = df.loc['인아']
df

    수학  영어   음악   체육  국어  일본어
서준  90  98   85  100  10   50
우현  80  89   95   90  20   50
인아  70  95  100   90  30   50
철수  10  20   30   40  50   60
영희  70  95  100   90  30   50

In [40]:
# 서준의 체육점수를 80점으로 변경하기 loc 사용
df.loc['서준','체육'] = 80
df

    수학  영어   음악  체육  국어  일본어
서준  90  98   85  80  10   50
우현  80  89   95  90  20   50
인아  70  95  100  90  30   50
철수  10  20   30  40  50   60
영희  70  95  100  90  30   50

In [41]:
#서준 국어 점수 10 -> 80 iloc 사용
df.iloc[0,4] = 80
df

    수학  영어   음악  체육  국어  일본어
서준  90  98   85  80  80   50
우현  80  89   95  90  20   50
인아  70  95  100  90  30   50
철수  10  20   30  40  50   60
영희  70  95  100  90  30   50

In [42]:
# 서준의 음악과 체육점수를 50점으로 변경하기

df.loc['서준',['음악','체육']] = 50
df

    수학  영어   음악  체육  국어  일본어
서준  90  98   50  50  80   50
우현  80  89   95  90  20   50
인아  70  95  100  90  30   50
철수  10  20   30  40  50   60
영희  70  95  100  90  30   50

In [43]:
# 서준의 음악 점수를 100점으로 체육점수를 50점으로 변경하기
df.loc['서준',['음악','체육']] = [100,50] # 아무것도 없을땐 튜플로 사용가능 100, 50
df

    수학  영어   음악  체육  국어  일본어
서준  90  98  100  50  80   50
우현  80  89   95  90  20   50
인아  70  95  100  90  30   50
철수  10  20   30  40  50   60
영희  70  95  100  90  30   50

In [44]:
# 우현의 음악점수를 100점 체육을 95점으로 변경하기 iloc 사용
df.iloc[1,2:4] = [60,0]
df

    수학  영어   음악  체육  국어  일본어
서준  90  98  100  50  80   50
우현  80  89   60   0  20   50
인아  70  95  100  90  30   50
철수  10  20   30  40  50   60
영희  70  95  100  90  30   50

In [45]:
# 행과열 바꾸기
df.transpose()

      서준  우현   인아  철수   영희
수학    90  80   70  10   70
영어    98  89   95  20   95
음악   100  60  100  30  100
체육    50   0   90  40   90
국어    80  20   30  50   30
일본어   50  50   50  60   50

In [46]:
# 행과열 바꾸기
df.T

      서준  우현   인아  철수   영희
수학    90  80   70  10   70
영어    98  89   95  20   95
음악   100  60  100  30  100
체육    50   0   90  40   90
국어    80  20   30  50   30
일본어   50  50   50  60   50

In [47]:
# df 만들기

df = {
    'r0' : [1,4,7,10,13],
    'r1' : [2,5,8,11, 14],
    'r2' : [3,6,9,12,15]
}
df = pd.DataFrame(df).T
df.columns = ['c0','c1','c2','c3','c4']
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [48]:
# 인덱스를 재설정하기
# 데이터 행은 4개인데 인덱스는 5개가 있다
# nan 값을 처리할때 사용하는 명령어 fill_value= 0 사용
new_index = ['r0','r1','r2','r3','r4']
ndf = df.reindex(new_index ,fill_value= 0)
ndf

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [49]:
# 못쓰는 데이터만 있는 index를 없애주고 indexname 이 index컬럼으로 생성되어서 들어옴.
ndf = df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

### 정렬

In [50]:
# 내림차순으로 행 인덱스 정렬(ascending=False)
# 오름차순은 ascending=True 또는 안쓰면됨.
df.sort_index(ascending=False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [51]:
# 내림차순 => c1컬럼
# inplace=True 바로 적용으로 저장됨 그냥 확인용은 안써도 됨
df.sort_values(by='c1',ascending=False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [52]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

# DataFrame 연산

In [53]:
# 요즘 많이 쓴대 
# 타이타닉 데이터 가져오려고 씀
import seaborn as sns

In [54]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### 특성공학 == 컬럼엔지니어링 
#### 컬럼가지고 새로운 컬럼을 유추하는것
- 제곱,제곱근 ...

In [55]:
# titanic에서 age와 fare부분의 컬럼만 발췌하여 df라는 dataFrame만들기

df =  titanic.loc[:,['age','fare']]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [56]:
# 평균 등등등등 한번에 보여주는 명령어 describe() -> 이렇게 보니까 숫자구나
df.describe()

              age        fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [57]:
# 모든 컬럼을 10씩 증가하기 addition이라는 dataFrame생성하기
addition = df + 10
addition.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [58]:
# addition과 df의 차를 구하여 subtraction 이라는 Dataframe 만들기
subtraction =  addition - df 
subtraction.head()

    age  fare
0  10.0  10.0
1  10.0  10.0
2  10.0  10.0
3  10.0  10.0
4  10.0  10.0